In [1]:
# Step-01: Data Pre-processing

In [1]:
# importing libraries 

import numpy as nm  
import matplotlib.pyplot as mtp  
import pandas as pd

In [4]:
#importing datasets  
dataset= pd.read_csv('Social_Networkads.csv')  
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [5]:
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [6]:
dataset.shape

(400, 5)

In [7]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [8]:
#Converting categorical values to numerical values
dataset = pd.get_dummies(dataset,drop_first=True)

In [9]:
dataset.head()

    User ID  Age  EstimatedSalary  Purchased  Gender_Male
0  15624510   19            19000          0            1
1  15810944   35            20000          0            1
2  15668575   26            43000          0            0
3  15603246   27            57000          0            0
4  15804002   19            76000          0            1

In [10]:
#checking each value counts
dataset['Purchased'].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [11]:
#dropping User ID column
dataset = dataset.drop('User ID',axis = 1)
dataset.head()

   Age  EstimatedSalary  Purchased  Gender_Male
0   19            19000          0            1
1   35            20000          0            1
2   26            43000          0            0
3   27            57000          0            0
4   19            76000          0            1

In [14]:
#Seperating X and y
X = dataset.loc[:,['Age','EstimatedSalary','Gender_Male']].values
y = dataset.loc[:,['Purchased']].values

In [15]:
y.shape

(400, 1)

In [16]:
#splitting in training and testing values
from sklearn.model_selection import train_test_split

In [17]:
X_train,X_test,y_train,y_test = train_test_split(X,y,random_state = 0,test_size = 0.25)

In [18]:
#Feature Scaling
#For better accuracy

In [19]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [20]:
#Model building

In [21]:
from sklearn.linear_model import LogisticRegression

In [23]:
model = LogisticRegression()

In [24]:
model.fit(X_train,y_train)

C:\Users\Admin\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression()

In [26]:
#predictions

y_pred = model.predict(X_test)

In [27]:
#Model evaluation

In [28]:
from sklearn.metrics import accuracy_score,confusion_matrix

In [31]:
cfm = confusion_matrix(y_test,y_pred)

In [32]:
cfm

array([[65,  3],
       [ 7, 25]], dtype=int64)

In [33]:
accuracy_score(y_test,y_pred)

0.9